title: NCA-0007-0003.1505.003 Persistence - Webshell Detection Apache
id: 310d13a6-a9a7-44b5-a55d-000377dea89b
author: NCA
description: Monitor the process execution of cmd.exe and powershell.exe that are spawned from 'httpd.exe', which represents Apache process.
status: stable
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4688
    CreatorProcessName|endswith: httpd.exe
    NewProcessName|endswith:
    - 'cmd.exe'
    - 'powershell.exe'
  condition: selection
falsepositives:
- "Web applications that retrives system information and perform AD query via system shell. Can be excluded as a full/partial command. Example added."
- "The detection does not include the commands that has been run by the attacker."
level: high
