title: NCA-0020-0003.1078.002 Persistence - PowerShell Web Access Activity Using Service Account 
id: 1bb5fa9f-e246-4c69-9db7-d10ad6d764e0
author: NCA
description: Detects the usage of a service account related to PowerShell Web Access (PSWA). While the `pswa_pool` user is typically used in legitimate configurations, adversaries may exploit this service account for persistence or unauthorized access.
status: stable
logsource:
    product: windows
    service: Logon/Logoff
detection:
    selection:
        EventID: 4648
        ProcessName|endswith: w3wp.exe
        User|contains: pswa_pool
    condition: selection
falsepositives:
    - Legitimate PowerShell Web Access by administrators using the `pswa_pool` service account.
level: medium
