title: NCA-0017-0003.1546.010 Persistence - AppInit tamper (Registry Creation or Modification via command line)
id: 897a12ac-e9c7-48c2-b4cc-454cf99fd0cc
author: NCA
description: Detects creation or modification via command line operations of the registry keys related to AppInit which could indicate malicious DLLs insertion attempt to maintain persistence.
status: stable
logsource:
    product: windows
    service: Sysmon
detection:
    selection:
        EventID: 1
        Image|endswith: reg.exe
        CommandLine|contains:
        - "\Microsoft\Windows NT\CurrentVersion\Windows\AppInit_DLLs"
        - "\Microsoft\Windows NT\CurrentVersion\Windows\LoadAppInit_DLLs"
    condition: selection
falsepositives:
- Legitimate software installation or updates that modify or create these keys.
level: medium