title: NCA-0004-0002.1059.003 Execution - SQLCmd (Windows Events)
id: 1876b983-4041-4e47-9522-64862b4a250e
author: NCA
description: Detect any execution of the SQLOSCMD command against Microsoft Database (DB) servers using Windows security events as a data source.
status: experimental
logsource:
  product: windows
  Service: security
detection:
  selection:
    EventID: 4688
    NewProcessName|endswith:
    - 'cmd.exe'
    - 'powershell.exe'
    CreatorProcessName|endswith: 
    - 'sqlservr.exe'
  condition: selection 
falsepositives:
- Unknown
level: high