title: NCA-0009-0006.1003 Credential Access - Esentutl
id: b8ae25ee-5cf9-42cf-9235-85bfd4eca07f
author: NCA
description: Detects suspicious uses of Windows Built-in executable "esentutl.exe" to copy sensitive files such as "SAM/SYSTEM" hive. The executable could also be used to write file to an Alternative Data Stream (ADS), which could be used as an evasion technique.
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 1
    OriginalFileName:
    - 'esentutl.exe'
  selection2:
    CommandLine|contains:
    - 'sam'
    - 'system'
    - 'ntds.dit'
  condition:  selection1 and selection2
falsepositives:
- Unknown
level: medium

