title: NCA-0005-0006.1003 Credential Access - DCC
id: 7fb79413-ac63-4586-8b6c-7c3daa6a915e
author: NCA
description: Detect access to the domain cached credential registry located in the local machine.
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection1:
    EventID: 4663
  selection2:
    objectName:
    - '\registry\machine\security\cache'
  filter:
    ProcessName|contains:
    - 'lsass'
    - 'services'
  condition: (selection1 and selection2) and not filter
falsepositives:
- Unknown
level: medium
