title: NCA-0010-0006-1003 Credential Access - Malicious SSPs
id: 30ddc1eb-fd37-4285-8bdd-dc5cfd16d8bb
author: NCA
description: This rule is designed to monitor any additions made to the installed Security Support Providers (SSPs) within a Windows machine. Attackers often exploit this technique to load malware into the lsass process.
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 13
    TargetObject: 'HKLM\System\CurrentControlSet\Control\Lsa\Security Packages'
  filter:
    SourceImage|endswith:
    - 'msmpeng.exe'
    - 'wininit.exe'
    - 'csrss.exe'
  condition: selection1 and not filter
falsepositives:
- Unknown
level: medium
