title: NCA-0001-0006.1003 Credential Access - DcSync
id: f8916706-bcb3-4f74-ad3b-4b6f8248ebfd
author: NCA 
description: This Sigma rule focuses on detecting DcSync attacks, which are late-stage kill chain attacks targeting Domain Controllers (DCs). DcSync allows attackers to simulate the behavior of a DC and retrieve password data via domain replication. 
status: stable
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4662
    ObjectServer: 'DS'
  extended_right:
    Properties|contains|all:
    - '19195a5b-6da0-11d0-afd3-00c04fd930c9'
    - '1131f6ad-9c07-11d1-f79f-00c04fc2dcd2'
  filter:
    AccountName|endswith:
    - '$'
  condition: selection and extended_right and not filter
falsepositives:
    - improper parsing of the "property" field could lead to the quiry not working, manual alteration could be needed depending on your parsing technoligy 
level: high
