title: NCA-0006-0006-1003 Credential Access - Artifacts
id: 0fe13fb1-0d9b-4498-ac73-5ba8e1735e2e
author: NCA
description: Detect possible artifacts left behind by credential dumping tools.
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection:
    EventID: 11
    TargetFilename|contains:
    - 'test.pwd'
    - 'lsremora.dll'
    - 'lsremora64.dll'
    - 'fgexec.exe'
    - 'pwdump'
    - 'kirbi'
    - 'wce_ccache'
    - 'wce_krbtkts'
    - 'wceaux.dll'
    - 'PwHashes'
    - 'SAM.out'
    - 'SECURITY.out'
    - 'SYSTEM.out'
    - 'NTDS.out'
    - 'DumpExt.dll'
    - 'DumpSvc.exe'
    - 'cachedump64.exe'
    - 'cachedump.exe'
    - 'pstgdump.exe'
    - 'servpw64.exe'
    - 'servpw.exe'
    - 'pwdump.exe'
    - 'fgdump-log'
    - 'mimikatz'
    - 'mimilsa.log'
  condition: selection
falsepositives:
- Unknown
level: medium
