title: NCA-0017-0006.1003 Credential Access - Suspicious LSASS Access
id: 1efc4ab1-97a5-4b02-9cd6-d1906fea2408
author: NCA
description: Detects suspicious access and NTLM credential dumps of the LSASS (Local Security Authority Subsystem Service) process. The LSASS process is responsible for authentication on Windows systems. This rule identifies events from the Windows Sysmon service with Event ID 10, indicating a process access event. It specifically looks for events where the target image contains 'lsass.exe' and the granted access matches certain values associated with credential access. The rule also filters out events where the source image contains 'msmpeng.exe', 'wininit.exe', or 'csrss.exe' to exclude known legitimate processes. The condition for detection is the combination of all the selection criteria.
status: stable
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 10
  selection2:
    TargetImage|contains:
    - 'lsass.exe'
  selection3:
    GrantedAccess:
    - '0x147a'
    - '0x1010'
    - '0x1400'
    - '0x1410'
    - '0x1fffff'
  selection4:
    SourceImage|contains:
    - 'msmpeng.exe'
    - 'wininit.exe'
    - 'csrss.exe'
  condition: selection1 and selection2 and selection3 and not selection4
falsepositives:
- Application requiring access to the lsass process, such as antivirus software
level: high
