title: NCA-0002-0006.1003 Credential Access - Creating Volume Shadow Copy
id: 98c493d4-dcc0-4abb-b083-24ed43610c49
author: NCA
description: This Sigma rule focuses on detecting the execution of 'vssadmin.exe', a command-line utility used for managing Volume Shadow Copies in Windows. Volume Shadow Copy creation can be leveraged as a credential access technique
status: stable
logsource:
  product: windows
  service: security
detection:
  selection:
    ProcessName|endswith:
      - 'vssadmin.exe'
    CommandLine|contains:
      - 'shadow'
      - 'create'
      - 'delete'
  condition: selection
falsepositives:
- Legitimate usage of Volume Shadow Copy.
level: high
