title: NCA-0007-0006.1003 Credential Access - Comsvcs
id: 20bb767f-3451-4dee-af76-f3cad18d7af2
author: NCA
status: experimental
description: Adversaries can use built-in library 'comsvcs.dll' to dump credentials on a compromised host.
logsource:
  product: windows
  sevice: Sysmon
detection:
  selection1:
    CommandLine|contains|all:
    - 'comsvcs.dll'
    - 'minidump'
  selection2:
    CommandLine|contains|all:
    - 'comsvcs.dll'
    - '#24'
  condition: selection1 OR selection2
falsePositive:
- Unknown
level: medium