title: NCA-0027-0006.1649 Credential Access - Active Directory Certificate Services ESC15
id: a5e71339-ecbc-4a74-b4d3-c70a5c46d814
author: NCA
description: Detects AD CS approval of a certificate signing request (CSR) that uses the built-in (Version 1) Server Authentication EKU  which was proved to be vulnerable to ESC15 vulnerability. Note that AD CS event ID 4898 is not enabled by default, please refer back to NCA guidelines for windows auditing.
status: stable
date: 2024/10/30
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4898
        TemplateContent|contains|all: 
            - '1.3.6.1.5.5.7.3.1' # Server Authentication EKU OID
            - 'CT_FLAG_ENROLLEE_SUPPLIES_SUBJECT'
            - 'msPKI-Template-Schema-Version = 1'
    condition: selection
falsepositives:
    - Legitimate request using a built-in (version 1) web server template.
level: medium