title: NCA-0018-0006.1003 Credential Access - Task Manager
id: dfc5d63f-0a22-4b86-918b-ba840c777f1d
author: NCA
description: Detects the usage of the native Task Manager application in Windows to dump the "lsass" process. Dumping the "lsass" process is a technique commonly employed by attackers to collect a dump file containing sensitive authentication credentials, which can then be subjected to offline password cracking attempts.
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 11
  selection2:
    TargetFilename|contains:
    - 'lsass'
  selection3:
    Image:
    - 'c:\windows\system32\taskmgr.exe'
  condition:  selection1 and selection2 and selection3
falsepositives:
- Unknown
level: high

