title: NCA-0025-0006.1003.003 Credential Access - NTDSutil
id: d5ef5f22-4790-467b-8d41-e80cba6abdee
author: NCA
description: Detect the execution of ntdsutil.exe, a tool commonly used for various attacks against the NTDS database (NTDS.DIT) and copying the Security Account Manager (SAM). It focuses on process creation events and relies on Windows logs for monitoring.
status: stable
logsource:
    product: windows
    service: Sysmon
detection:
    selection:
        CommandLine|contains: 'ntdsutil'
    selection2:
        CommandLine|contains: 'Copy'
    selection3:
        CommandLine|contains: 
            - 'ntds.dit'
            - 'config\SAM'
    condition: selection or (selection2 and selection3)
falsepositives:
- Administrative activity
level: high