title: NCA-0015-0006.1003 Credential Access - RDP-MSTSC
id: 84ecfd96-3e9a-4ec1-97d4-01cc87a8bce1
author: NCA
description: Detect the use of credential dumping techniques to extract Remote Desktop Protocol (RDP) credentials through Terminal Services (MSTSC.exe). It focuses on Windows systems and relies on Sysmon event logs for monitoring.
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection:
    EventID: 10
    TargetImage|endswith:
    - 'mstsc.exe'
    GrantedAccess:
    - '0x143a'
  condition:  selection
falsepositives:
- Unknown
level: medium
