title: NCA-0019-0006.1003 Credential Access - VSS(NinjaCopy)
id: b48c7223-7e81-42be-904e-8920521d4d12 
author: NCA
description: Detect attempts to create a Volume Shadow Copy (VSS) using the "invoke VSS-Copy" technique. It focuses on Windows systems and monitors PowerShell activity. 
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection1:
    EventID: 4103
  selection2:
    CommandName: Get-Service
    value: 'vss'
    HostApplication|endswith: 
    - powershell.exe
    - PowerShell_ISE.exe
  condition: selection1 AND selection2
falsepositives:
- Unknown
level: medium
