title: NCA-0013-0006.1003 Credential Access - ProcDump (CallTrace)
id: af98d791-c8e1-4f8f-a3aa-4fbdd3512d82
author: NCA
description: Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter in combination with the lsass.exe process. That catches cases in which the attacker has renamed the procdump executable.
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 10
  selection2:
    TargetImage|endswith:
    - 'lsass.exe'
  selection3:
    CallTrace|contains:
    - 'dbghelp.dll'
    - 'dbgcore.dll'
  condition:  selection1 and selection2 and selection3
falsepositives:
- Unknown
level: medium
