title: NCA-0004-0006.1003 Credential Access - WDigest
id: b0753974-de30-4b9d-a92d-46365afac80d
author: NCA
description: Detect an attacker enabling insecure WDigest authentication protocols in order to save cleartext credentials.
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 13
    Details: 'DWORD (0x00000001)'
  selection2:
    TargetObject:
    - 'HKLM\System\CurrentControlSet\Control\SecurityProviders\WDigest\Negotiate'
    - 'HKLM\System\CurrentControlSet\Control\SecurityProviders\WDigest\UseLogonCredential'
  condition: selection1 and (selection2) 
falsepositives:
- Unknown
level: medium
