title: NCA-0024-0006.1003 Credential Access - Malicious Services Installation
id: 6a6a0de9-9d3b-4e96-ab67-92dfee394df5
author: NCA
description: Detect known malicious service installations that typically appear in cases of suspicious activity.
status: experimental
logsource:
    product: windows
    service: system
detection:
    selection:
        EventID: 7045
        ServiceName|contains:
            - 'WCESERVICE'
            - 'WCE SERVICE'
            - 'winexesvc'
            - 'DumpSvc'
            - 'pwdump'
            - 'gsecdump'
            - 'cachedump'
            - 'PSEXESVC'
    condition: selection
falsepositives:
- Unknown
level: high