title: NCA-0026-0006.1649 Credential Access - Active Directory Certificate Service Domain Escalation
id: cd06a1b2-3bad-4a96-82bc-f32e85399b73
author: NCA
description: Detects AD CS approval of a certificate signing request (CSR) that uses misconfigured template which enables authentication and allow requesters to specify SubjectAltName (SAN) without adequate validation of its value. The rule will be noisy with misconfigured templates, it is recommended to address the misconfigured template if it is used in the environment. Note that AD CS event ID 4898 is not enabled by default, please refer back to NCA guidelines for windows auditing.
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4898
        pKIExtendedKeyUsage|contains:
            - '1.3.6.1.5.5.7.3.2'
            - '1.3.6.1.5.2.3.4'
            - '1.3.6.1.4.1.311.20.2.2'
            - '2.5.29.37.0'
        TemplateContent|contains: 'CT_FLAG_ENROLLEE_SUPPLIES_SUBJECT'
    condition: selection
falsepositives:
    - Legitimate request using a vulnerable template
level: medium