title: NCA-0003-0006.1003 Credential Access - Hive Dumping(Registry Save)
id: c25248d1-503c-4fcd-97f9-3f34d6005508
author: NCA
description: Detect instances where the 'reg save' command is manually executed to copy a registry hive to disk. It focuses on Windows systems and monitors relevant event logs. 
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 1
    Image|endswith:
    - 'reg.exe'
  selection2:
    CommandLine|contains|all: 
    - 'hklm\sam'
    - 'save'
  condition: selection1 AND selection2
falsepositives:
- unknown
level: high
