title: NCA-0012-0006.1003 Credential Access - NPPSpy
id: 9a23618e-b0a8-465f-86f5-03ead9672183
author: NCA
description: Detects loading a malicious DLL (i.e. NPPSpy) into Network Providers. The DLL will log the cleartext password after installation for each login request and will write it to a file on disk. 
status: stable
logsource:
  product: windows
  service: Sysmon
detection:
  selection1:
    EventID: 13
  selection2:
    TargetObject:
    - 'HKLM\System\CurrentControlSet\Control\NetworkProvider\Order\PROVIDERORDER'
  condition: selection1 and selection2
falsepositives:
- Administrators/Applications modifying Network provider to add functionality.
level: medium
