title: NCA-0023-0006.1212 Credential Access - ZeroLogon2
id: 3bbc0498-1acd-4905-9df1-00914c814f3b
author: NCA
description: Detect anonymous users changing machine passwords, which is behavior often exhibited by Zero Logon proof-of-concept (POC) exploits. It focuses on Windows security logs for monitoring.
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4742
    SubjectUserName|contains: 'anonymous'
    TargetUserName|endswith: '$'
  selection2:
    EventID: 4742
    SubjectUserSid|contains: 'S-1-0'
    TargetUserName|endswith: '$'
  condition: selection OR selection2
falsepositives:
- Unknown
level: high

