title: NCA-0022-0006.1212 Credential Access - ZeroLogon
id: 90ce4d97-c4f4-4f51-a763-025cf35c72ee
author: NCA
description: Detect potential credential access activity related to the ZeroLogon vulnerability. It leverages a new log event introduced in a Windows update.
status: experimental
logsource:
  product: windows
  service: system
detection:
  selection:
    EventID: 5829
  condition: selection
falsepositives:
- Unknown
level: high
