title: NCA-0004-0007.1018 Discovery - Domain joined host discovery
id: 1f7dbd81-261f-469c-8ef6-78ea25cb5e2a
author: NCA
description: Detect an attacker enumerating domain-joined machines using PowerShell.
status: stable
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4104
    ScriptBlockText|contains|all:
    - 'System.DirectoryServices.DirectorySearcher'
    - 'Properties.operatingsystem'
  condition: selection
falsepositives:
- "Administrative scripts or tools like Vulnerability Scanners"
level: medium