title: NCA-0039-0005.1562.002 Defense Evasion - Disable Windows Event Logs Providers via CommandLine (wevtutil)
id: 91bce1f1-3e7a-4f7e-95a1-2a8eafde4f23
author: NCA
description: Detects adversaries using commandline to disable Windows Event Logging providers or channels.
status: stable
logsource:
    product: windows
    category: process_creation
detection:
    selection1:
        Image|endswith: '\wevtutil.exe'
        CommandLine|contains:
            - ' sl '
            - ' set-log '
    selection2:
        CommandLine|contains:
            - 'e:false'
            - 'enabled:false'
    filter_msiexec:
        ParentImage:
            - 'C:\Windows\SysWOW64\msiexec.exe'
            - 'C:\Windows\System32\msiexec.exe'
        CommandLine|contains: ' sl '
    condition: (selection1 and selection2) and not filter_msiexec
falsepositives:
    - Legitimate administrative activity
level: high