title: NCA-0038-0005.1562.002 Defense Evasion - Disable Windows Event Logs Providers via CommandLine (reg.exe)
id: 91bce1f1-3e7a-4f7e-95a1-2a8eafde4f23
author: NCA
description: Detects adversaries using commandline to disable Windows Event Logging providers or channels.
status: stable
logsource:
    product: windows
    category: process_creation
detection:
  selection:
    Image|endswith: '\reg.exe'
    CommandLine|contains|all: 
      - '\CurrentVersion\WINEVT\Channels\'
      - ' add '
      - ' /d '
      - 'Enabled'
      - ' 0'
  condition: selection
falsepositives:
  - legitimate administrative activity
level: high