title: NCA-0036-0005.1112 Defense Evasion - Background Context Menu Spoofing (Registry Creation or Modification)
id: b20de94b-3853-44a2-b68f-1dba0f98da4b
author: NCA
description: Detects the creation or modification under the "shell" registry key, which is associated with the background context menu. Adversaries may exploit the inherent trust users place in these familiar options as it provides a convenient way to access common commands or actions. Note that to detect the registry modification, the following path "Directory\background\shell\" must be included in Sysmon configuration file, please refer back to NCA guidelines for windows and Sysmon auditing.
status: stable
logsource:
  product: windows
  service: Sysmon
detection:
  selection:
    EventID: 
    - 12
    - 13
    Image|endswith: reg.exe
    TargetObject|contains: 'Directory\background\shell\'
  condition: selection 
falsepositives:
    - Legitimate background keys creation for operational tasks
level: high

