title: NCA-0004-0004.1068 Privilege Escalation - PrintNightmare (DLL execution - windows)
id: 53a6a5d2-5c10-4ddf-84e8-c0970aefca6b
author: NCA
description: this rule will help threat hunters to detect any possible explitation activities of PrintNightmare.
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4688
    CreatorProcessName|endswith: spoolsv.exe
    NewProcessName|endswith: rundll32.exe
  condition: selection
falsepositives:
- Unknown
level: High
