title: NCA-0005-0004.1068 Privilege Escalation - PrintNightmare (FileCreate - Sysmon)
id: 5e158765-4584-470a-ae9f-7cf8aff94f8d
author: NCA
description: detect possible exploitation activities related to PrintNightmare vulnerability in the Windows Print Spooler service. This vulnerability, categorized as both Remote Code Execution (RCE) and Privilege Escalation, allows for the remote execution of DLL files on Windows servers with system privileges."
status: experimental
logsource:
  product: windows
  service: Sysmon
detection:
  selection:
    EventID: 11
    Image|endswith: spoolsv.exe
    TargetFilename|endswith: dll
  Exclude:
      TargetFilename|endswith: 
      - 'unidrv.dll'
      - 'kernelbase.dll'
  condition:
  - selection and not Exclude 
falsepositives:
- Unknown
level: High
